_protected/frontend/controllers/PencakerController.php

    public function actionCreate()
    {
        $model = new IpkPencaker();
        $email = new Email();
        if ($model->load(Yii::$app->request->post())) {
					 $model->secret = $model->password;
           // if ($model->validate()) {
            $model->password =md5(Yii::$app->params['passKey'].$model->password);
           // }
          // try{
						$file_name = $model->no_nik;
						if (!empty(UploadedFile::getInstance($model, 'foto'))) {
							$xFile1 = UploadedFile::getInstance($model, 'foto');
							$model->foto = $file_name.'-foto'.'.'.$xFile1->extension;
						}
						if (!empty(UploadedFile::getInstance($model, 'curiculum_viteae'))) {
							$xFile2 = UploadedFile::getInstance($model, 'curiculum_viteae');
							$model->curiculum_viteae = $file_name.'-cv'.'.'.$xFile2->extension;
						}
						if (!empty(UploadedFile::getInstance($model, 'lampiran'))) {
							$xFile3 = UploadedFile::getInstance($model, 'lampiran');
							$model->lampiran = $file_name.'-lampiran'.'.'.$xFile3->extension;
						}
             $model->save();
             // if($model->save()){
								$pendidikan = new IpkPendidikan();
                $pendidikan->pencaker_id =  $model->id;
                $pendidikan->jenis =  $model->pddk_jenis;
                $pendidikan->tingkat =  $model->pddk_tingkat;
                $pendidikan->jurusan =  $model->pddk_jurusan;
                $pendidikan->save();
                if (!empty(UploadedFile::getInstance($model, 'foto')))
									$xFile1->saveAs(Yii::getAlias('@webroot').'/uploads/pencaker/foto/' . $file_name.'-foto'.'.'.$xFile1->extension);
---
INSERT INTO `ipk_pendidikan` (`pencaker_id`, `jenis`, `tingkat`, `jurusan`) VALUES (175, NULL, 5000, NULL)
INSERT INTO `ipk_pencaker` (`email`, `password`, `no_nik`, `nama`, `tgl_lahir`, `jenis_kelamin`, `hp`, `alamat_jalan`, `provinsi_id`, `kabupaten_id`, `kecamatan_id`, `agama_id`, `pddk_tingkat`, `pddk_lainnya`, `minat_negara`, `minat_jabatan`, `foto`, `curiculum_viteae`, `no_bpjs`, `sts_kompetensi`, `sts_sehat`, `sts_dokumen`, `secret`) VALUES ('xxix@ggmail.com', 'ffc92089fea7037c284a6534141ad3ab', '112233', '123', '2018/07/01', 1, '1234', '123', 15, 236, 2911, 3, 5000, 'qwe', 5, '002.016', '112233-foto.jpg', '112233-cv.jpg', '123', 1, 1, 1, '123')

				$email->from = Yii::$app->params['adminEmail'];
				$email->title = 'Konfirmasi Pendaftaran infokerja-jatim.com';
				$email->content = '<p>Anda mendapatkan email ini karena anda dengan email <b>'.$model->email.'</b> mengajukan permintaan "Pendaftaran Sebagai Perusahaan Baru pada infokerja-jatim.com". </br></br> Jika anda benar-benar menyetujui untuk melakukannya silahkan klik link berikut. </p></br></br><a href="'.$url.'">'.$url.'</a></br></br> Jika tidak setuju abaikan email ini</br>Terimakasih';
				$email->save();
---
INSERT INTO `email` (`to`, `from`, `title`, `content`) VALUES ('xxix@ggmail.com', 'admin@example.com', 'Konfirmasi Pendaftaran infokerja-jatim.com', '<p>Anda mendapatkan email ini karena anda dengan email <b>xxix@ggmail.com</b> mengajukan permintaan \"Pendaftaran Sebagai Perusahaan Baru pada infokerja-jatim.com\". </br></br> Jika anda benar-benar menyetujui untuk melakukannya silahkan klik link berikut. </p></br></br><a href=\"ptsp.infokerja-jatim.com/site/activate_pencaker?token=VktYSmFBd2V1YlpNcVVLL2FjMktCdz09\">ptsp.infokerja-jatim.com/site/activate_pencaker?token=VktYSmFBd2V1YlpNcVVLL2FjMktCdz09</a></br></br> Jika tidak setuju abaikan email ini</br>Terimakasih')

    protected function findModel($id)
    {
        if (($model = IpkPencaker::findOne($id)) !== null) {
---
SELECT * FROM `ipk_pencaker` WHERE `id`='175'

    public function actionKabupaten($id=0) //ajax sub pendidikan
    {
      $usaha= IpkKabupaten::find()->where(['provinsi_id' => $id])->all();
---
SELECT * FROM `ipk_kabupaten` WHERE `provinsi_id`='14'

    public function actionKecamatan($id=0) //ajax sub pendidikan
    {
      $usaha= IpkKecamatan::find()->where(['kabupaten_id' => $id])->all();
---
SELECT * FROM `ipk_kecamatan` WHERE `kabupaten_id`='239'