_protected/frontend/controllers/SiteController.php

    public function actionIndex()
    {
      $slider = (new \yii\db\Query())
        ->select('*')
        ->from('pci_posting')
        ->innerJoin('pci_kategori', 'pci_posting.kategori_id=pci_kategori.id')
        ->where(['pci_kategori.kategori' => 'slider'])
        ->andWhere(['pci_posting.sts_aktif' => '1'])
        ->orderBy('pci_posting.id DESC')
        ->limit('10')
        ->all();
---
SELECT * FROM `pci_posting` INNER JOIN `pci_kategori` ON pci_posting.kategori_id=pci_kategori.id WHERE (`pci_kategori`.`kategori`='slider') AND (`pci_posting`.`sts_aktif`='1') ORDER BY `pci_posting`.`id` DESC LIMIT 10