_protected/frontend/views/layouts/main.php

<?php
  $baseUrl = Yii::getAlias('@web');

  $text_slider = (new \yii\db\Query())
    ->select('*')
    ->from('web_info')
    ->where(['sts_tampil'=>1])
		->orderBy('urutan ASC')
    ->all();
  $header = (new \yii\db\Query())
    ->select('*')
    ->from('header')
    ->orderBy('urutan ASC')
    ->where('sts_tampil=1')
    ->all();
---
SELECT * FROM `web_info` WHERE `sts_tampil`=1 ORDER BY `urutan`
SELECT * FROM `header` WHERE sts_tampil=1 ORDER BY `urutan`