_protected/frontend/views/pencaker/_form.php

SELECT * FROM `ipk_agama`
SELECT * FROM `ipk_provinsi`
SELECT * FROM `ipk_kabupaten` WHERE `provinsi_id` IS NULL
SELECT * FROM `ipk_kecamatan` WHERE `kabupaten_id` IS NULL
---
/* @var $this yii\web\View */
/* @var $model app\models\IpkPencaker */
/* @var $form yii\widgets\ActiveForm */
  $agama= IpkAgama::find()->all();
  $listAgama=ArrayHelper::map($agama,'id','nama');
  $provinsi= IpkProvinsi::find()->all();
  $listProvinsi=ArrayHelper::map($provinsi,'id','nama');
  $kabupaten= IpkKabupaten::find()->where(['provinsi_id' => $model->provinsi_id])->all();
  $listKabupaten=ArrayHelper::map($kabupaten,'id','nama');
  $kecamatan= IpkKecamatan::find()->where(['kabupaten_id' => $model->kabupaten_id])->all();

SELECT * FROM `ipk_jenispddk` WHERE (`levels`='G') AND (`kode` != '4000')
---
  // $listKatjabatan=ArrayHelper::map($katjabatan,'kode','nama');
  // $goljabatan= IpkJabatanKelompok::find()->where(['ipk_jabatan_pokok_id'=>$model->jabatan_pokok])->all();
  // $listGoljabatan=ArrayHelper::map($goljabatan,'kode','nama');
  $daftarpendidikan= IpkJenispddk::find()->where(['levels' => 'G'])->andWhere(['!=','kode','4000'])->all();

SELECT * FROM `negara_tujuan`
SELECT * FROM `jabatan`
---
  // $listSubpendidikan=ArrayHelper::map($subPendidikan,'kode','nama');
  // $sub2Pendidikan= IpkJenispddk::find()->where(['kode_parent' => $model->pddk_jenis])->all();
  // $listSub2pendidikan=ArrayHelper::map($sub2Pendidikan,'kode','nama');
  $minatNegara= NegaraTujuan::find()->all();
  $listMinatNegara=ArrayHelper::map($minatNegara,'id','negara');
  $jabatan= Jabatan::find()->all();